{
  "main": {
    "name":"Qianqian Song Lab",
    "labName": "Song Lab",
    "description":"Welcome to Song Lab",
    "image":"Qianqian_Song.jpg",
    "bio":"Assistant Professor & Director of Translational Bioinformatics\nBioinformatics, Biomedical Informatics\n Department of Health Outcomes and Biomedical Informatics\nCollege of Medicine, University of Florida",
    "contactmessage":"Feel free to contact me via email.",
    "email": "qsong1@ufl.edu",
    "phone": "352-627-9467",
    "github":"https://github.com/QSong-github",
    "project":"https://github.com/QSong-github",
    "linkedin": "https://www.linkedin.com/in/qianqian-song-4501b56b/",
    "uf_profile": "https://hobi.med.ufl.edu/profile/song-qianqian/",
    "address":{
      "street":"1889 Museum Rd, Suite 7000.",
      "city":"Gainesville",
      "state":"FL",
      "zip": "32611"
    },
    "website": "https://hobi.med.ufl.edu/profile/song-qianqian/",
    "resumedownload":"http://timbakerdev.com",
    "social":[
      {
        "name":"twitter",
        "url":"https://x.com/Sophie_QSong",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/qianqian-song-4501b56b/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/QSong-github",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":"Beijing Normal University, Wake Forest University",
        "degree":"Ph.D. in Applied Mathematics, Joint Ph.D. in Bioinformatics",
        "graduated":"April 2017",
        "description":""
      },
      {
        "school":"Beijing Normal University",
        "degree":"M.S. in Applied Mathematics",
        "graduated":"2014",
        "description":""
      },
      {
        "school":"Beijing Normal University",
        "degree":"B.S. in Applied Mathematics",
        "graduated":"2011",
        "description":""
      }
    ],
    "work":[
      {
        "company":"University of Florida",
        "title":"Tenure-track Assistant Professor",
        "years":"October 2023 - Present",
        "description":"Department of Health Outcomes & Biomedical Informatics"
      },
      {
        "company":"Wake Forest School of Medicine",
        "title":"Tenure-track Assistant Professor",
        "years":"April 2021 - October 2023",
        "description":"Department of Cancer Biology"
      },
      {
        "company":"Wake Forest School of Medicine",
        "title":"Postdoctoral Fellow",
        "years":"April 2018 - October 2021",
        "description":"Department of Cancer Biology"
      },
      {
        "company":"Wake Forest School of Medicine",
        "title":"Joint-trained Ph.D. student",
        "years":"September 2015 - July 2017",
        "description":"Department of Radiology"
      },
      {
        "company":"Wake Forest School of Medicine",
        "title":"Research Fellow",
        "years":"January 2013 - December 2013",
        "description":"Department of Radiology"
      },
      {
        "company":"The Methodist Research Institute, Weill Cornell Medical College",
        "title":"Research Fellow",
        "years":"October 2012 - January 2013",
        "description":"Bioinformatics and Bioimaging"
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"60%"
      },
      {
        "name":"VueJs",
        "level":"55%"
      },
      {
        "name":"ReactJs",
        "level":"50%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"PHP",
        "level":"80%"
      },
      {
        "name":"Swift",
        "level":"50%"
      },
      {
        "name":"JAVA",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"01.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"02.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"03.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"04.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"05.jpg",
        "url":"http://www.smirkspace.com"
      },
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"06.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"01.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"02.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"03.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"04.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"05.jpg",
        "url":"http://www.smirkspace.com"
      },
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"06.jpg",
        "url":"https://www.canadianwanderlust.com"
      }
    ]
  },
  "teams": {
    "current": {
      "Postdoc Fellow": [
        {
          "name": "Yanfei Wang, PhD (Advisor)",
          "department": "Department of Health Outcomes and Biomedical Informatics, College of Medicine, UF",
          "time": "2023 – current",
          "imagePath": "images/yanfei_wang.jpeg"
        }
      ],
      "PhD student": [
        {
          "name": "Jialu Liang (Advisor)",
          "department": "Department of Health Outcomes and Biomedical Informatics, College of Medicine, UF",
          "time": "2024 – current"
        },
        {
          "name": "Yining Pan (Advisor)",
          "department": "Department of Health Outcomes and Biomedical Informatics, College of Medicine, UF",
          "time": "2024 – current"
        }
      ],
      "MS student": [
        {
          "name": "Qing Wang (Advisor)",
          "department": "Department of Health Outcomes and Biomedical Informatics, College of Medicine, UF",
          "time": "2024 – current"
        },
        {
          "name": "Minghao Zhou(Advisor)",
          "department": "Department of Health Outcomes and Biomedical Informatics, College of Medicine, UF",
          "time": "2023 – current"
        }
      ],
      "High school students": [
        {
          "name": "Samuel Tong (Advisor)",
          "department": "",
          "time": "2024 – current"
        }
      ],
      "Undergraduate students": [
        {
          "name": "Zijia Tang (Advisor)",
          "department": "undergraduate student, Duke Unviersity",
          "time": "2023 – current"
        }
      ]
    },
    "graduated": {
      "PhD student": [
        {
          "name": "Ziyang Tang (Co-advisor, dissertation committee member)",
          "department": "Department of Computer and Information Technology, Purdue University",
          "time": "2024"
        },
        {
          "name": "Farhad Dastmalchi (Supervisory committee member)",
          "department": "Department of Health Outcomes and Biomedical Informatics, College of Medicine, UF",
          "time": "2024"
        }
      ],
      "MS student": [
        {
          "name": "Mengyuan Zhang (Supervisory committee member)",
          "department": "Department of Health Outcomes and Biomedical Informatics, College of Medicine, UF",
          "time": "2024"
        },
        {
          "name": "Zhaorui Liu (Co-advisor)",
          "department": "Department of Health Outcomes and Biomedical Informatics, College of Medicine, UF",
          "time": "2023"
        }
      ],
      "others": [
        {
          "name": "Mohammad Shafieinouri (MD-PhD Interview committee member)",
          "department": "University of Maryland‐Baltimore",
          "time": "2024"
        },
        {
          "name": "Tatyana Cook (Advisor)",
          "department": "Georgia Institute of Technology",
          "time": "2022"
        },
        {
          "name": "Chenhao Li (Advisor)",
          "department": "University of Illinois Urbana-Champaign",
          "time": "2022"
        },
        {
          "name": "Zheyu Fu (Advisor)",
          "department": "University of Illinois Urbana-Champaign",
          "time": "2022"
        }
      ]
    }
  },
  "publications": {
    "ManuscriptUnderReview": [
      "Li B, Tang Z, Budhkar A, Zhang T, Yang B, Su J, Song Q*, \"SpaIM: Single-cell Spatial Transcriptomics Imputation via Style Transfer.\" Nature Communications",
      "Tang Z, Zhou M, Song Q*, \"scPerb: predict single-cell perturbation via style transfer-based variational autoencoder.\" Journal of Advanced Research",
      "Wang Y, Chen X, Yu W, Shrugg T, Hsu F, Eadon M, Su J, Song Q*, \"PCCA variant rs16957301 is a novel AKI risk genotype-specific for patients who receive ICI treatment: Real-world evidence from All of Us cohort.\" European Journal of Cancer",
      "Kawatani K, Aikawa T, Tabrizi Z, Pan Y, Ren Y, Wang N, Kurti A, Nambara T, Ikezu C, Shue F, Bamkole M, Inoue Y, Parsons T, Bu G, Song Q, Bracko O, Kanekiyo T. \"A novel mouse model for cerebral small vessel disease through cerebrovascular CDKN2A/p16INK4A induction.\" Neuron",
      "Chen W, Zhang P, Tran T, Li S, Li L, Youker K, Fang L, Brannan K, Chen S, Chen K, Song Q, Cooke J, Wang G, \"A visual–omics foundation model to bridge histopathology image with transcriptomics.\" Nature Methods",
      "Liu Y, Wang Y, Zhou M, Zhang G, Song Q, Zhou X, \"Investigating Brain Biomechanical Properties in Alzheimer's Disease.\" Nature Communications",
      "Liu X, Wang G, Wang A, Wen J, Kim P, Song Q, Zhou X, \"CRISPRoffT: Comprehensive database of CRISPR/Cas off-targets.\" Nucleic Acids Research",
      "Zhang P, Chen W, Tu T, Kandel I, Zhou M, Song Q, Wang G, \"An extensive computational infrastructure leverages pathology workflow by integrating imaging and omics data.\" Nature Communications",
      "Budhkar A, Song Q, Su J, Zhang X, \"Demystifying the Black Box: A Survey on Explainable Artificial Intelligence (XAI) in Bioinformatics.\" BMC Bioinformatics"
    ],
    "PublishedJournalArticles": [
      "Liu X, Wang Q, Zhou M, Zhou X, Song Q*, “DrugFormer: graph-enhanced language model to predict drug sensitivity.” Advanced Science (2024)",
      "Liu X, Yi J, Li T, Wen J, Kim P, Song Q*, Zhou X, “DRMref: comprehensive reference map of drug resistance mechanisms.” Nucleic Acids Research (2024)",
      "Tang Z, Zhou M, Zhang K, Song Q*, “scPerb: predict single-cell perturbation via style transfer-based variational autoencoder.” Journal of Advanced Research (2024)",
      "Wang Y, Chen X, Yu W, Shrugg T, Hsu F, Eadon M, Su J, Song Q*, “PCCA variant rs16957301 is a novel AKI risk genotype-specific for patients who receive ICI treatment: Real-world evidence from All of Us cohort”. European journal of Cancer (2024)",
      "Li B, Zhang Y, Wang Q, Zhang C, Li M, Wang G, Song Q*, “Gene Expression Prediction from Histology Images via Hypergraph Neural Networks.” Briefings in Bioinformatics (2024)",
      "Budhkar A, Tang Z, Liu X, Zhang X, Su J, Song Q*, “xSiGra: Explainable model for single-cell spatial data elucidation.” Briefings in Bioinformatics (2024)",
      "Wang Q, Li Y, Zhou X, Song Q*, “AntiFormer: Knowledge graph enhanced LLM for binding affinity prediction.” Briefings in Bioinformatics (2024)",
      "Liu L, Dong P, Peng A, Song Q*, He Z, “Understanding Inflammatory Bowel Disease at Single-cell resolution.” Computational and Structural Biotechnology Journal (2024)",
      "Zhu W, Du Z, Xu Z, Yang D, Chen M, Song Q*, “SCRN: Single-cell Gene Regulatory Network Identification in Alzheimer's Disease.” IEEE/ACM Transactions on Computational Biology and Bioinformatics (2024)",
      "Li Z, Liu X, Tang Z, Zhang P, Jin N, Eadon M, Song Q*, Chen Y, Su J. “TrajVis: a visual clinical decision support system to translate artificial intelligence trajectory models in the precision management of chronic kidney disease.” Journal of the American Medical Informatics Association (2024)",
      "Gatz AE, Xiong C, Chen Y, Jiang S, Nguyen CM, Song Q, Li X, Zhang P, Eadon MT, Su J. “Health disparities in the risk of severe acidosis: real-world evidence from the All of Us cohort.” Journal of the American Medical Informatics Association (2024)",
      "Liu X, Wang G, Wang A, Wen J, Kim P, Song Q, Zhou X, \"CRISPRoffT: Comprehensive database of CRISPR/Cas off-targets.\" Nucleic Acids Research (2024)",
      "Joyce BT, Yao J, Zheng Y, Gao T, Nannini D, Lin S, Li X, Meliker J, Song Q, Jacobs D, Lloyd-Jones D. “Temperature and carotid intima-medial thickness: The coronary artery risk development in young adults (CARDIA) study.” The Science of the total environment (2024).",
      "Wu C, Ning W, Wu T, Chen J, Yao H, Tao Z, Zhao X, Diao K, Wang J, Wang W, Li X. “TCfinder: Robust tumor cell discriminationin scRNA-seq based on gene pathway activity.” iMetaOmics (2024).",
      "Liu H, Marayati M, Cerda D, Lemezis B, Gao J, Song Q, Chen M, Zhang K, “The Cross-Regulation Between Set1, Clr4, and Lsd1/2 in Schizosaccharomyces pombe.” PLOS Genetics (2024)",
      "Tang Z, Zhang T, Yang B, Su J, Song Q*, “SiGra: Single-cell spatial elucidation through image-augmented graph transformer.” Nature Communications (2023)",
      "Bouch RJ, Zhang J, Miller BC, Robbins CJ, Mosher TH, Li W, Krupenko SA, Nagpal R, Zhao J, Lu Y, Nikiforov MA, Song Q*, He Z. “Distinct inflammatory Th17 subsets emerge in autoimmunity and infection.” Journal of Experimental Medicine (2023)",
      "Tang Z, Zhang T, Yang B, Su J, Song Q*, “SpaRx: Elucidate single-cell spatial heterogeneity of drug responses for personalized treatment.” Briefings in Bioinformatics (2023)",
      "Tang Z, Zhang T, Yang B, Su J, Song Q*, “spaCI: deciphering spatial cellular communications through adaptive graph model.” Briefings in Bioinformatics (2023)",
      "Song Q, O’Neill S, Pasche B, Miller L, Ruiz J, Chan M, Soike M, “Single-cell sequencing reveals the landscape of the human brain metastatic microenvironment.” Communications Biology (2023)",
      "Rao F, Chen M, Yang D, Morrell B, Song Q*, Zhu W. “scENT for revealing gene clusters from single-cell RNA-seq data.” IEEE/ACM Transactions on Computational Biology and Bioinformatics (2023)",
      "Tang Z, Zhang T, Song Q*, Su J, Yang B. “PINet: Privileged Information Improve the Interpretablity and generalization of structural MRI in Alzheimer’s Disease.” In Proceedings of the 14th ACM International Conference on Bioinformatics, Computational Biology, and Health Informatics (ACM BCB '23)",
      "Lu Z, Miao X, Song Q, Ding H, Skardal A, Dai K, Zhao W, Lu B, Atala A, “Detection of lineage-reprogramming efficiency of tumor cells in a 3D-printed tumor-on-a-chip model.” Theranostics (2023)",
      "Meyers A, Wang Z, Han W, hao Q, Zabalawi M, Duan L, Zhang Q, Manne R, Lorenzo F, Quinn M, Song Q, Fan D, Lin H, Furdui C, Locasale J, McCall C, Zhu X. “Pyruvate dehydrogenase kinase supports macrophage NLRP3 inflammasome activation during acute inflammation.” Cell Reports (2023)",
      "Jiang Y, Song L, Lin Y, Li T, Li B, Mao X, Song Q, Xing C, Zheng G, Huang S, Jin L, “ROS-mediated SRMS activation confers platinum resistance in ovarian cancer.” Oncogene (2023)",
      "Walton N, Nagarajan R, Wang C, Sincan M, Freimuth R, Everman D, Walton D, Lemas D, Benos P, Alekseyenko A, Song Q, Uzun E, Taylor C, Alpher U, Person T, Rappoport N, Zhao Z, Williams M. “Enabling Clinical Application of Artificial Intelligence in Genomics: An Analysis of Current State and Future Needs - From the AMIA Genomics and Translational Bioinformatics Workgroup.” Journal of the American Medical Informatics Association (2023)",
      "Zhang J, Liu Q, Zhang H, Dai M, Song Q, Yang D, Wu G, Chen M. “Uncovering the System Vulnerability and Criticality of Human Brain Under Dynamical Neuropathological Events in Alzheimer’s Disease.“ Journal of Alzheimer’s Disease (2023)",
      "Miao X, Wang H, Fan C, Song Q, Ding R, Wu J, Hu H, Chen K, Ji P, Wen Q, Shi M, Ye B, Fu D, Xiang M. “Enhancing prognostic accuracy in head and neck squamous cell carcinoma chemotherapy via a lipid metabolism-related clustered polygenic model.” Cancer Cell International (2023)",
      "Liu Y, Smith M, Wang Y, D’Agostino R, Ruiz J, Lycan T, Kucera G, Miller L, Li W, Chan M, Farris M, Su J, Song Q, Zhao D, Chandrasekaran A, Xing F, “c-Met mediated cytokine network promotes brain metastasis of breast cancer by remodeling neutrophil activities.” Cancers (2023)",
      "Ji Z, Song Q, Su J. “Advanced computational systems biology approaches for accelerating comprehensive research of the human brain.” Frontiers in Genetics (2023)",
      "Xu E, Zhang J, Li J, Song Q, Yang D, Wu G, Chen M. “Pathology Steered Stratification Network for Subtype Identification in Alzheimer's Disease.” Medical Physics (2023)",
      "N Yao, W Jiang, Y Wang, Song Q, X Cao, Zheng W, Zhang J, \"An immune-related signature for optimizing prognosis prediction and treatment decision of hepatocellular carcinoma.\" European Journal of Medical Research (2023)",
      "Huang H, Tang Z, Zhang T, Yang B, Song Q, Su J. “Feature Selection for Unsupervised Machine Learning”. 2023 IEEE 8th International Conference on Smart Cloud (2023)",
      "Song Q, Bates B, Shao YR, Hsu F, Liu F, Madhira V, Mitra A, Bergquist T, Kavuluru R, Li X, Sharafeldin N, Su J, Topaloglu U, \"Risk and outcome of breakthrough COVID-19 infections in vaccinated patients with cancer: real-word evidence from the National COVID Cohort Collaborative (N3C).\" Journal of Clinical Oncology (2022)",
      "Chen M, Xu C, Xu Z, He Z, Su J, Song Q*, “Uncovering the dynamic effects of DEX treatment on lung cancer by integrating bioinformatic inference and multiscale modeling of scRNA-seq and proteomics data.” Computers in biology and medicine (2022)",
      "Song Q*, Jin L, Zhu X, Su J, “SMGR: a joint statistical method for integrative analysis of single-cell multi-omics data.” NAR genomics and bioinformatics (2022)",
      "Chen M, Jia S, Xue M, Huang H, Xu Z, Yang D, Zhu W, Song Q*. “Dual-Stream Subspace Clustering Network for Revealing Gene Targets in Alzheimer’s Disease.” Computers in Biology and Medicine (2022)",
      "Song Q, L Liu, “Single-Cell RNA-Seq Technologies and Computational Analysis Tools: Application in Cancer Research.” Methods in molecular biology (2022)",
      "Liu Y, Wang L, Song Q, Ali M, Crowe W, Kucera G, Hawkins G, Soker S, Thomas K, Miller L, Lu Y, Bellinger C, Zhang W, Habib A, Petty J, Zhao D. “Intrapleural nano-immunotherapeutic promotes innate and adaptive immune responses to enhance anti-PD-L1 therapy for malignant pleural effusion.” Nature Nanotechnology (2022)",
      "Yoo KW, Yadav MK, Song Q, Atala A, Lu B. “Targeting DNA polymerase to DNA double-strand breaks reduces DNA deletion size and increases templated insertions generated by CRISPR/Cas9.” Nucleic Acids Research (2022)",
      "Zhang J, Wang L, Song Q, Xiao M, Gao J, Cao X, Zheng W. “Organoids in recapitulating tumorigenesis driven by risk factors: Current trends and future perspectives.” International Journal of Biological Sciences (2022)",
      "Bian S, Ni W, Zhu M, Zhang X, Qiang Y, Zhang J, Ni Z, Shen Y, Qiu S, Song Q, Xiao M. ”Flap endonuclease 1 Facilitated Hepatocellular Carcinoma Progression by Enhancing USP7/MDM2-mediated P53 Inactivation.” International Journal of Biological Sciences (2022)",
      "Li T, Mehraein-Ghomi F, Forbes E, Namjoshi S, Ballard A, Song Q, Chou P, Wang X, Kerrigan B, Lang F, Lesser G, Debinski W, Yang X, Zhang W, “HSP90-CDC37 functions as a chaperone for the oncogenic FGFR3-TACC3 fusion.” Molecular Therapy (2022)",
      "Triozzi P, Stirling E, Song Q, Westwood B, Kooshki B, Forbes E, Holbrook B, Cook K, Alexander-Miller M, Miller L, Zhang W, Soto-Pantoja D, “Circulating Immune Bioenergetic, Metabolic, and Genetic Signatures Predict Melanoma Patients' Response to Anti–PD-1 Immune Checkpoint Blockade.” Clinical Cancer Research (2022)",
      "Song Q, Su J, Zhang W. “scGCN: a Graph Convolutional Networks Algorithm for Knowledge Transfer in Single Cell Omics.” Nature Communications (2021)",
      "Song Q*, Su J. “DSTG: Deconvoluting Spatial Transcriptomics Data through Graph-based Artificial Intelligence.” Briefings in Bioinformatics (2021)",
      "Sharafeldin N, Bates B, Song Q, Madhira V, Yan Y, Dong S, Lee E, Kuhrt N, Shao YR, Liu F, Bergquist T. “Outcomes of COVID-19 in Patients With Cancer: Report From the National COVID Cohort Collaborative (N3C).” Journal of Clinical Oncology (2021)",
      "Sharafeldin N, Bates B, Song Q, Madhira V, Shao YR, Liu F, Bergquist T, Su J, Topaloglu U. “Reply to K. Takada et al.” Journal of Clinical Oncology (2021)",
      "Lu Z, Rajan S, Song Q, Zhao Y, Wan M, Aleman J, Skardal A, Bishop C, Atala A, Lu B. “3D scaffold-free microliver with drug metabolic function generated by lineage reprogrammed hepatocytes from human fibroblasts.” Biomaterials (2021)",
      "Sun L, Zhang X, Song Q, Liu L, Forbes E, Tian W, Zhang Z, Kang Y, Wang H, Fleming J, Pasche B, Zhang W. “IGFBP2 promotes tumor progression by inducing alternative polarization of macrophages in pancreatic ductal adenocarcinoma through the STAT3 pathway.” Cancer Letters (2021)",
      "Zhu M, Wu M, Bian S, Song Q, Xiao M, Huang H, You L, Zhang J, Zhang J, Cheng C, Ni W. “DNA primase subunit 1 deteriorated progression of hepatocellular carcinoma by activating AKT/mTOR signaling and UBE2C-mediated P53 ubiquitination.” Cell & Bioscience (2021)",
      "Zhu M, Huang Y, Bian S, Song Q, Zhang J, Zheng W. “Organoid model: Current Implications and Pharmaceutical Applications in Liver Diseases.” Current Molecular Pharmacology (2021); 14(4):498-508",
      "Zhang J, Song Q, Wu M, & Zheng W. “The Emerging Roles of Exosomes in the Chemoresistance of Hepatocellular Carcinoma.” Current medicinal chemistry (2021)",
      "Ni W, Bian S, Zhu M, Song Q, Zhang J, Xiao M, Zheng W. “Identification and Validation of Ubiquitin-specific Proteases as a Novel Prognostic Signature for Hepatocellular Carcinoma.” Frontiers in Oncology (2021)",
      "Su J, Song Q, Qasem S, O’Neill S, Furdui C, Pasche B, Metheny-Barlow L, Masters A, Lo H, Xing F, Watabe K, Miller L, Tatter S, Laxton A, Whitlow C, Chan M, Soike M, Ruiz J. “Multi-Omics Analysis of Brain Metastasis Outcomes Following Craniotomy.” Frontiers in Oncology (2021)",
      "Zheng W, Zhang J, Song Q, Xu Y, Zhu M, Ma J. “Rac Family Small GTPase 3 Correlates with Progression and Poor Prognosis in Bladder Cancer.” DNA and Cell Biology (2021)",
      "Song Q, Su J, Miller L, Zhang W. “scLM: automatic detection of consensus gene clusters across multiple single-cell datasets.” Genomics, Proteomics & Bioinformatics (2020)",
      "Zhang J, Gu C, Song Q#, Zhu M, Xu Y, Xiao M, Zheng W. “Identifying cancer-associated fibroblasts as emerging targets for hepatocellular carcinoma.” Cell & Bioscience (2020)",
      "Bian S, Ni W, Zhu M, Song Q, Zhuang J, Ni R, Zheng W. “Identification and Validation of the N6-methyladenosine RNA Methylation Regulator YTHDF1 as A Novel Prognostic Marker and Potential Target for Hepatocellular Carcinoma.” Frontiers in Molecular Biosciences (2020)",
      "Zhang J, Wu M, Xu Y, Song Q, Zheng W. “Secretory Clusterin: A Promising Target for Chemoresistance of Hepatocellular Carcinoma.” Mini reviews in medicinal chemistry (2020)",
      "Song Q, Hawkins G, Wudel L, et.al. “Dissecting intratumoral myeloid cell plasticity by single cell RNA-seq.” Cancer Medicine (2019)",
      "Zhang J, Song Q, Liu J, Lu L, Xu Y, & Zheng W. “Cyclin-Dependent Kinase Regulatory Subunit 2 Indicated Poor Prognosis and Facilitated Aggressive Phenotype of Hepatocellular Carcinoma.” Disease markers (2019)",
      "Berger C, Korkut A, et.al, Song Q, et.al. “A comprehensive Pan-Cancer molecular study of gynecologic and breast cancers.” Cancer Cell (2018)",
      "Song Q, Zhang W and Sun Y. “Haploinsufficiency and mutation are two sides of the cancer coin as cause and therapeutics target.” Translational Cancer Research (2017)",
      "Luo J, Liu L, Suresh V, Song Q, and Zhou X. \"RPI-Bind: a structure-based method for accurate identification of RNA-protein binding sites.\" Scientific Reports (2017)",
      "Song Q, Wang H, Miller L and Zhou X. “Systems biology approach to studying proliferation-dependent prognostic subnetworks in breast cancer.” Scientific Reports (2015)"
  ],
    "ConferenceAbstracts": [
      "Wang Y, Xiong C, Bian J, Song Q, and Su J. “Unraveling the role of CTLA-4 variants in acute kidney injury after ICI treatments.” ASCO 2024",
      "Chen Y, Li X, Madhira V, Shugg T, Jalal SI, Eadon M, Bates B, Sharafeldin N, Topaloglu U, Song Q, Su J. The survival benefits and the risk of severe renal injury of immune checkpoint inhibitors in patients with cancer: The real-world evidence from the National Clinical Cohort Collaborative (N3C). ASCO 2024",
      "Li B, Zhang Y, Wang Q, Zhang C, Li M, Wang G, Song Q*, “Gene Expression Prediction from Histology Images via Hypergraph Neural Networks.” AI, Systems and Spatial Biology In Human Disease Conference 2024",
      "Li Z, Liu X, Tang Z, Jin N, Eadon M, Song Q, Chen Y, Su J. “TrajVis: a visual clinical decision support system to translate AI/ML trajectory models in the precision management of CKD.” AMIA 2023",
      "Song Q, Bates B, Hsu FC, Liu F, Madhira V, Mitra AK, Bergquist T, Li X, Sharafeldin N, Topaloglu U, Su J. “COVID-19 omicron variants demonstrated different virulence in infected patients with cancer: The real-world evidence from the National COVID Cohort Collaborative (N3C).” ASCO 2022",
      "Sharafeldin N, Madhira V, Song Q, Bates B, Mitra AK, Liu F, Bergquist T, Su J, Hsu FC, Topaloglu U. “Long COVID-19 in patients with cancer: Report from the National COVID Cohort Collaborative (N3C).” ASCO 2022",
      "Mitra AK, Mukherjee U, Mazumder S, Madhira V, Bergquist T, Shao Y, Liu F, Song Q, Su J, Bates B, Sharafeldin N. “Major risk factors associated with severe COVID-19 outcomes in patients with multiple myeloma: Report from the National COVID-19 Cohort Collaborative (N3C).” ASCO 2022",
      "Song Q, Su J, “Deconvoluting Spatial Transcriptomics Data through Graph-based Artificial Intelligence.” AMIA 2021 Informatics Summit",
      "Su J, Song Q, Espeland M, Williamson J, “DEPOT: Revealing Trajectories of Alzheimer’s Disease Development for Precision Monitoring and Interventions Using Real-world Evidence.” AMIA 2021 Informatics Summit",
      "Song Q, Su J, Topaloglu U, Zhang W. “scGCN: Leveraging Single-cell Transcriptomics Data through Graph-based Artificial Intelligence.” AMIA 2020",
      "Song Q, Forbes E, Miller L, Triozzi P, Liu L, Zhang W, Soto-Pantoja D. “Single-cell analysis predicts immunotherapy response in melanoma.” 2020 Tumor Heterogeneity: From Single Cells to Clinical Impact Special Conference Abstracts",
      "Song Q, Su J, Miller L, Zhang W. “scLM: automatic detection of consensus gene clusters across multiple single-cell datasets.” Cancer Res 2020",
      "Song Q, Hawkins G, Wudel L, et.al. “Dissecting intratumoral cell-cell interactions in myeloid reprogramming by single cell RNA-seq.” Cancer Res 2019",
      "Su J, Song Q, O’Neill S, Pasche B, Miller L, Ruiz J, Chan M, Soike M. “Single Cell RNA Sequencing Reveals Pan-Brain Metastasis Immune Landscape.” AMIA 2020",
      "Li T, Mehraein-Ghomi F, Namjoshi S, Song Q, Ballard E, Forbes M, Chou P, Yang X, Zhang W. “Abstract B036: Targeting Hsp90-Cdc37 complex in glioma harboring FGFR3-TACC3.” Mol Cancer Ther 2019",
      "Sun L, Song Q, Tian W, Zhang Z. “MiR-506 suppresses tumor progression by reprogramming macrophage polarization in pancreatic ductal adenocarcinoma.” Cancer Res 2019",
      "Wu D, Su J, Song Q, Zhou X. “SDF1/CXCR4 regulates stiffness of bone marrow stromal cell through RhoA and Rac1 GTPases pathway to support myeloma cell proliferation in multiple myeloma.” Cancer Research 2013"
    ]
  },
  "GrantsAndContractAwards": {
    "OngoingResearchSupport": [
      {
        "id": "1R35GM151089-01 (Song)",
        "time": "08/10/23 – 06/30/28",
        "description": "Multi-modal insights of spatially distributed cells with associations of diseases and drug response. Aim: The overall goals are to develop a novel class of machine learning, statistical and deep learning approaches for the enhancement, prioritization, and interpretation of spatially organized cells in complex tissue, through leveraging resources including GWAS studies and pharmacogenomics knowledgebase, thus to better understand the molecular mechanisms underpinning disease and drug response.",
        "role": "Principal Investigator, total award amount: $1,896,915"
      },
      {
        "id": "1P30CA247796 (Licht)",
        "time": "06/2023 – 05/2027",
        "description": "University of Florida Health Cancer Center Support Grant. Aim: The new UFHCC strategic plan, Momentum 2027, has 4 pillars: 1) conduct transdisciplinary research (RNA biology, microbiome); 2) translate UFHCC discoveries to trials (immunotherapy, small molecules, cancer communication); 3) address cancer burden (cancer and aging, cancer health disparities); and, 4) train a prepared and diverse cancer research workforce, including leadership development. UFHCC is poised to make a major impact on the cancer burden of the catchment area, Florida, and beyond.",
        "role": "Co-Investigator"
      },
      {
        "id": "Rutgers State Contract (Sankyo)",
        "time": "10/2023 – 10/2024",
        "description": "Predicative Modeling of the Prevalence of Non-Small Cell Lung Cancer Biomarkers. Aim: We aim to assess the association of HER2 status with multiple demographic, behavioral, and clinical characteristics in geographically different and diverse populations within the United States. We will develop and validate the model using institutional electronic health records data from three cancer centers. We will then apply the prediction model to national cancer registry data to estimate the prevalence of HER2 status in NSCLC patients.",
        "role": "Co-Investigator"
      },
      {
        "id": "1RF1MH130782-01A1 (Lu)",
        "time": "09/2023 – 08/2026",
        "description": "A germline- and promoter-independent strategy to gain access to all cell types in the brain. Aim: We propose to develop an AAV-based Cell-Type-Specific Targeting (ACTSTar) system to enable easy access to any cell type in the brain in any species that is independent of germline modification and promoter isolation and characterization. We plan to generate a library of ACTSTar drivers to target 50 different brain cell types in the mouse and marmoset. In addition, to reduce off-target integration and neuroinflammation associated with long-term Cas9 expression, especially in long-term experiments in primates.",
        "role": "Co-Investigator"
      }
    ],
    "Pending": [
      {
        "id": "1R01HL180587-01 (Wang, Song, Li)",
        "time": "07/2025 – 06/2030",
        "description": "Multi-Modal AI Model for Enhancing Drug Screening in Peripheral Arterial Disease. Goal: The primary goal of this project is to revolutionize drug screening and therapeutic development for Peripheral Arterial Disease (PAD) by developing and integrating advanced multi-modal artificial intelligence (AI) technologies. This will involve combining spatial transcriptomics, pathology images, and a comprehensive knowledge graph with AI-driven approaches to better understand the PAD microenvironment and improve treatment options.",
        "role": "Principal Investigator"
      },
      {
        "id": "R01AG094917 (Song, Zhou)",
        "time": "07/2025 – 06/2030",
        "description": "Multi-organ and Multi-scale Computational Modeling of Alzheimer's Disease. Goal: This project seeks to advance our understanding of the genetic links between cardiovascular and neurological phenotypes, enhancing AD diagnosis and facilitating the development of personalized therapeutic strategies.",
        "role": "Principal Investigator"
      },
      {
        "id": "3R01CA296250-A1 (Su, Song, Shugg)",
        "time": "07/2025 – 06/2030",
        "description": "Live longer, live healthier: graph causal artificial intelligence for precision immunotherapy. Aim: Our multidisciplinary research team proposes to use a causal artificial intelligence model, gCAI, to reliably estimate the individual renal toxicity difference (ΔIRT) among candidate drugs as well as the individual treatment effects (ITE) for cancer patients. Such counterfactual prediction models will provide actionable knowledge of which treatments are safe and effective for a specific patient.",
        "role": "Principal Investigator"
      }
    ],
    "Completed": [
      {
        "id": "1R21CA267853-02 (Ming)",
        "time": "12/2022 – 09/2023",
        "description": "Targeted Anchoring Ecto-enzyme on Cancer Cell Surface to Enhance Antibody Therapy in Breast Cancer. Goal: We will elucidate the mechanisms of TME reprograming by surface ADA anchoring and will develop an approach to enhance surface ADA anchoring by combination with a tyrosine kinase inhibitor. This project can be directly translated into a targeted cancer immunotherapy to treat patients with HER2+ BC. By addressing lack of disease specificity, a main obstacle to the development of next-generation immunotherapeutic regimens, we will contribute to the use of precision medicine for cancer immunotherapy.",
        "role": "Co-Investigator"
      },
      {
        "id": "1R01CA258692-01A1 (Miller/Votanopoulos)",
        "time": "01/2022 – 09/2023",
        "description": "Establishing the Repertoire of Actionable Alterations in Appendiceal Adenocarcinoma. Overall goal: To develop a working knowledge base of the genetic alterations that underlie appendiceal adenocarcinoma (AA) and pursue development of actionable genetic tests to guide critical AA treatment decisions. My responsibility is to assist biologists to identify the genetic alterations in AA patients and related single-cell analysis.",
        "role": "Co-Investigator"
      },
      {
        "id": "1R01AI173277-01 (He)",
        "time": "10/2022 – 04/2023",
        "description": "Dissecting functions of IL-23-dependent inflammatory Th17 cells. Goal: We propose to identify the mechanisms by which a metabolomic enzyme is selectively required for Th17-mediated autoimmunity but not Th17-dependent defensive immunity.",
        "role": "Co-Investigator"
      }
    ]
  },
  "DevelopedSoftwareAndTools": [
    {
      "name": "University of Florida Cancer data commons",
      "description": "University of Florida Cancer data commons",
      "link": "https://ufcdc-portal.org/"
    },
    {
      "name": "scPerb",
      "description": "Predict single-cell perturbation via style transfer-based variational autoencoder.",
      "link": "https://github.com/QSong-github/scPerb"
    },
    {
      "name": "xSiGra",
      "description": "Explainable model for single-cell spatial data elucidation.",
      "link": "https://github.com/QSong-github/xSiGra"
    },
    {
      "name": "DrugFormer",
      "description": "Graph-enhanced language model to predict drug sensitivity.",
      "link": "https://github.com/QSong-github/DrugFormer"
    },
    {
      "name": "AntiFormer",
      "description": "Knowledge graph enhanced LLM for binding affinity prediction.",
      "link": "https://github.com/QSong-github/AntiFormer"
    },
    {
      "name": "HGGEP",
      "description": "Gene Expression Prediction from Histology Images via Hypergraph Neural Networks.",
      "link": "https://github.com/QSong-github/HGGEP"
    },
    {
      "name": "SpaRx",
      "description": "Elucidate spatial heterogeneity of drug sensitivity for personalized treatment.",
      "link": "https://github.com/QSong-github/SpaRx"
    },
    {
      "name": "SiGra",
      "description": "Single-cell spatial elucidation through image-augmented graph transformer.",
      "link": "https://github.com/QSong-github/SiGra"
    },
    {
      "name": "spaCI",
      "description": "Deciphering spatial cellular communications through adaptive graph model.",
      "link": "https://github.com/QSong-github/spaCI"
    },
    {
      "name": "SMGR",
      "description": "A joint statistical method for integrative analysis of single-cell multi-omics data.",
      "link": "https://github.com/QSong-github/SMGR"
    },
    {
      "name": "BIMM",
      "description": "Uncovering the dynamic effects of DEX treatment on lung cancer by integrating bioinformatic inference and multiscale modeling of scRNA-seq and proteomics data.",
      "link": "https://github.com/QSong-github/BIMM"
    },
    {
      "name": "scGCN",
      "description": "A Graph Convolutional Networks Algorithm for Knowledge Transfer in Single Cell Omics.",
      "link": "https://github.com/QSong-github/scGCN"
    },
    {
      "name": "DSTG",
      "description": "Deconvoluting Spatial Transcriptomics Data through Graph-based Artificial Intelligence.",
      "link": "https://github.com/QSong-github/DSTG"
    },
    {
      "name": "scLM",
      "description": "Automatic detection of consensus gene clusters across multiple single-cell datasets.",
      "link": "https://github.com/QSong-github/scLM"
    },
    {
      "name": "SPN",
      "description": "Biological mechanism in breast cancer with different proliferation levels.",
      "link": "https://github.com/QSong-github/SPN"
    }
  ],
  "news": [
    {
      "date": "2024",
      "description": "Our manuscript 'PCCA variant rs16957301 is a novel AKI risk genotype-specific for patients who receive ICI treatment: Real-world evidence from All of Us cohort' is accepted by European journal of Cancer!"
    },{
      "date": "2024",
      "description": "Our manuscript 'DrugFormer: graph-enhanced language model to predict drug sensitivity' is accepted by Advanced Science!"
    },
    {
      "date": "2024",
      "description": "Dr. Qianqian Song is invited to present at the Gulf Coast Consortia (GCC) Single Cell Omics Symposium"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'DRMref: comprehensive reference map of drug resistance mechanisms' is accepted by Nucleic Acids Research!"
    },
    {
      "date": "2024",
      "description": "Dr. Qianqian Song is invited to present at International Conference on Intelligent Biology and Medicine (ICIBM 2024)"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'scPerb: predict single-cell perturbation via style transfer-based variational autoencoder' is accepted by Journal of Advanced Research!"
    },
    {
      "date": "2024",
      "description": "Dr. Qianqian Song is invited to University of Florida Department of Health Outcomes and Biomedical Informatics/CTSI Design Studio!"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'Gene Expression Prediction from Histology Images via Hypergraph Neural Networks' is accepted by Briefings in Bioinformatics!"
    },
    {
      "date": "2024",
      "description": "Dr. Qianqian Song is invited to present at 9th Symposium of Science, Engineering & Biomedicine & The 5th Symposium of Humanities and Social Science!"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'xSiGra: Explainable model for single-cell spatial data elucidation' is accepted by Briefings in Bioinformatics!"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'AntiFormer: Knowledge graph enhanced LLM for binding affinity prediction' is accepted by Briefings in Bioinformatics!"
    },
    {
      "date": "2024",
      "description": "Dr. Qianqian Song is invited to present at 2024 AI, Systems and Spatial Biology in Human Disease Conference at Mayo Clinic!"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'Understanding Inflammatory Bowel Disease at Single-cell resolution' is accepted by Computational and Structural Biotechnology Journal!"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'SCRN: Single-cell Gene Regulatory Network Identification in Alzheimer's Disease' is accepted by IEEE/ACM Transactions on Computational Biology and Bioinformatics!"
    },
    {
      "date": "2024",
      "description": "Dr. Qianqian Song is invited to present at Florida Academic Cancer Center Alliance (FACCA) Annual Retreat!"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'TrajVis: a visual clinical decision support system to translate artificial intelligence trajectory models in the precision management of chronic kidney disease' is accepted by Journal of the American Medical Informatics Association!"
    },
    {
      "date": "2024",
      "description": "Dr. Qianqian Song is invited to present at the upcoming 20th Annual Meeting of the MidSouth Computational Biology and Bioinformatics Society (MCBIOS)!"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'Health disparities in the risk of severe acidosis: real-world evidence from the All of Us cohort.' is accepted by Journal of the American Medical Informatics Association!"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'CRISPRoffT: Comprehensive database of CRISPR/Cas off-targets.' is accepted by Nucleic Acids Research!"
    },
    {
      "date": "2024",
      "description": "Dr. Qianqian Song is invited to present at the Drug Discovery and Development (DDD) Seminar and Health Outcome Research and Policy (HORP) Seminar in Auburn University!"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'Temperature and carotid intima-medial thickness: The coronary artery risk development in young adults (CARDIA) study.' is accepted by The Science of the total environment!"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'TCfinder: Robust tumor cell discriminationin scRNA-seq based on gene pathway activity.' is accepted by iMetaOmics!"
    },
    {
      "date": "2024",
      "description": "Our manuscript 'The Cross-Regulation Between Set1, Clr4, and Lsd1/2 in Schizosaccharomyces pombe.' is accepted by PLOS Genetics!"
    },
    {
      "date": "2023",
      "description": "Dr. Qianqian Song is invited to present at the International Conference on Intelligent Biology and Medicine (ICIBM)!"
    },
    {
      "date": "2023",
      "description": "Our manuscript 'SiGra: Single-cell spatial elucidation through image-augmented graph transformer.' is accepted by Nature Communications!"
    },

    {
      "date": "2023",
      "description": "Dr. Qianqian Song is invited to present at the 2023 WFBCCC CGM retreat!"
    },
    {
      "date": "2023",
      "description": "Our manuscript 'Distinct inflammatory Th17 subsets emerge in autoimmunity and infection.' is accepted by Journal of Experimental Medicine!"
    },
    {
      "date": "2023",
      "description": "Dr. Qianqian Song is invited to present at the 2023 Great Lakes Bioinformatics Conference (GLBIO)!"
    },

    {
      "date": "Sep 2023",
      "description": "Our manuscript 'SpaRx: Elucidate single-cell spatial heterogeneity of drug responses for personalized treatment' is accepted by Briefings in Bioinformatics!"
    },
    {
      "date": "Sep 2023",
      "description": "Our manuscript 'Detection of lineage-reprogramming efficiency of tumor cells in a 3D-printed tumor-on-a-chip model' is accepted by Theranostics!"
    },
    {
      "date": "Sep 2023",
      "description": "Dr. Qianqian Song is invited to present at the Department of Biology, Wake Forest University"
    },
    {
      "date": "Aug 2023",
      "description": "We are incredibly grateful to the NIH/NIGMS for funding our R35 MIRA grant (Maximizing Investigators Research Award) for the next 5 years!"
    },
    {
      "date": "Aug 2023",
      "description": "Dr. Qianqian Song is invited as reviewer for the GenBio workshop at NeurIPS 2023",
      "additionalInfo": "https://genbio-workshop.github.io/index.html#"
    },
    {
      "date": "Aug 2023",
      "description": "Dr. Qianqian Song is invited as reviewer for the AI4Science workshop at NeurIPS 2023",
      "additionalInfo": "https://ai4sciencecommunity.github.io/neurips23.html"
    },
    {
      "date": "Aug 2023",
      "description": "Dr. Qianqian Song attended the MCBIOS 2023 annual board retreat! Welcome to MCBIOS 2024 in Atlanta!"
    },
    {
      "date": "Aug 2023",
      "description": "Dr. Qianqian Song is invited to present at the NCI-FNL’s Clinical and Translational Serology Task Force (CTTF) monthly meeting"
    },
    {
      "date": "Aug 2023",
      "description": "Our manuscript 'Enhancing prognostic accuracy in head and neck squamous cell carcinoma chemotherapy via a lipid metabolism-related clustered polygenic model' is accepted by Cancer Cell International!"
    },
    {
      "date": "Aug 2023",
      "description": "Dr. Qianqian Song is invited to present at the Biocompare Bench Tip Webinar"
    },
    {
      "date": "Aug 2023",
      "description": "Dr. Qianqian Song is invited to present at the 4th Edition of International Precision Medicine Conference"
    },
    {
      "date": "July 2023",
      "description": "Our manuscript 'PINet: Privileged Information Improve the Interpretablity and generalization of structural MRI in Alzheimer’s Disease' is accepted by ACM-BCB 2023!"
    },
    {
      "date": "July 2023",
      "description": "Our manuscript 'Pathology Steered Stratification Network for Subtype Identification in Alzheimer’s Disease' is accepted by Medical Physics!"
    },
    {
      "date": "July 2023",
      "description": "Dr. Qianqian Song is invited to present at the International Conference on Intelligent Biology and Medicine (ICIBM)"
    },
    {
      "date": "July 2023",
      "description": "Our manuscript 'SiGra: Single-cell spatial elucidation through image- augmented graph transformer' is accepted for publication in Nature Communications!"
    },
    {
      "date": "July 2023",
      "description": "Dr. Qianqian Song is invited to present at the 8th edition of International Webinar on Aging and Rejuvenation"
    },
    {
      "date": "July 2023",
      "description": "Our manuscript 'Single Cell RNA Sequencing Reveals Pan-Brain Metastasis Immune Landscape' is accepted for publication in Communications Biology!"
    },
    {
      "date": "July 2023",
      "description": "Dr. Qianqian Song is invited as the Guest Editor in Mathematical Biosciences and Engineering"
    },
    {
      "date": "Jun 2023",
      "description": "Dr. Qianqian Song is elected as the Board Member of the MidSouth Computational Biology and Bioinformatics Society (MCIBIOS)"
    },
    {
      "date": "Jun 2023",
      "description": "Our manuscript 'Sample average treatment effect on the treated analysis using counterfactual explanation identifies BMT and SARS-CoV-2 vaccination as protective risk factors associated with COVID-19 severity and survival in patients with multiple myeloma' is accepted for publication in Blood Cancer Journal!"
    }
  ],
  "research": {
    "introduction": "Our research focuses on three closely related areas in bioinformatics and biomedical informatics as outlined below.",
    "text": [
      {
        "title": "Advanced ML/AI Method Development",
        "content": "Recent advances in spatial molecular imaging have opened up new possibilities for examining the spatial landscapes and transcriptional profiles of tissues at subcellular resolution, providing deep insights into the spatial microenvironment. The current commercially available technologies for spatial high-plex profiling allow accurate capture of the locations of targeted transcripts, cell locations, and cell boundaries, accompanied by multi-channel immunohistochemistry images. However, interrogating such multi-modality spatial profiling poses challenges that overwhelm traditional machine learning approaches. Advanced ML/AI algorithms are needed to effectively decipher the intricate spatial imaging profiles.\n We have demonstrated the efficacy of Graph-based AI algorithms in various spatial profiling studies. One of our novel methods, Single-cell spatial elucidation through image-augmented Graph transformer (SiGra), is designed to reveal spatial domains and enhance the substantially sparse and noisy data in lung cancer spatial profiles. We also proposed a unique adaptive graph model with attention mechanisms, spaCI, which incorporates both spatial locations and gene expression profiles of cells to identify active Ligand-Receptor (L-R) signaling axes across neighboring cells. spaCI has proven effective in revealing L-R interactions in different cancer types, which could otherwise remain hidden due to data sparsity. Furthermore, we developed another novel graph-based convolutional network model, DSTG, to reliably and accurately decompose cell mixtures in spatially resolved transcriptomics spots of pancreatic cancer tissues. These Graph-based AI methods represent a significant advancement in the interpretation of complex spatial omics data, unlocking its potential for various applications in diverse biological research areas. \n These stuides have been published in high-impact journals including Nature Communications (IF: 17.69), Briefings In Bioinformatics (IF: 9.5), Genomics, Proteomics & Bioinformatics (IF: 9.5), etc."
      },
      {
        "title": "Single-cell omics and Multi-omics studies in diseases",
        "content": "Single-cell omics has been increasingly popular, revealing new biological knowledge, and reshaping our understanding of cellular heterogeneity. We have worked on novel methods on single-cell omics data that contribute to the understanding of the interplay of different molecule layers in the tumor microenvironment. For example, we have developed a robust graph-based convolutional network model, scGCN, to achieve effective knowledge transfer across single-cell omics datasets from different sources (e.g., different tissues, platforms, species, and molecular layers). We also developed a joint statistical method for the integrative analysis of single-cell multi-omics data, which enables the detection of coherent regulatory programs and target genes from unpaired single-cell RNA-seq (scRNA-seq) and single-cell ATAC-seq data of mixed-phenotype acute leukemia. We proposed a novel Dual-Stream Subspace Clustering Network model, DS-SCNet, to identify biologically meaningful gene clusters from single-cell RNA-seq data, as well as the other scLM method, to reveal the co-expressed gene signals across single-cell datasets from different sources. Another integrative approach of bioinformatics and multi-scale modeling on scRNA-seq and proteomics data enables the temporal drug response prediction of lung tumor cells.\n These studies provide fundamental work for gaining unbiased biological insights from the large single-cell omics data repository, which have been published in Nature Communications (IF: 17.69), Briefings In Bioinformatics (IF: 9.5), etc.\n We have been actively working on collaborative multi-omics studies via data-driven informatics approaches to facilitate the understanding of biological mechanisms. For example, we revealed inflammatory Th17 cells presenting distinct transcriptional and metabolic features that may allow precise therapeutic targeting in autoimmunity and infection. In malignant pleural effusion (MPE), we applied single-cell RNA-seq and revealed that intrapleural nano-immunotherapy reprogramed myeloid cells in the tumor microenvironment, reduced MPE and inhibited tumor growth, not only in the pleural cavity but also in the lung parenchyma. For melanoma patients with anti-PD-1 therapy, we used an integrative analysis of bioenergetics, metabolomic profiles, and single-cell RNA-seq data and identified a glycolytic signature characterizing checkpoint inhibitor responders.\n Our stuides have been published in high-impact journals including Journal of Experimental Medicine (IF: 17.6), Nature nanotechnology(IF: 40.5), Clinical Cancer Research (IF: 13.8), etc."
      },
      {
        "title": "Computational Oncology",
        "content": "With the cancer research community producing vast quantities of molecular and phenotypic data to investigate tumor progression, the concept of big data in cancer field has emerged due to the rapid data accumulation. This presents both opportunities and challenges for discovering novel insights into fundamental questions. Various data types, including genomics, proteomics, transcriptomics, and clinical information such as electronic health records, are available from patient or preclinical samples. It is crucial to analyze such diverse multi-modality data to reveal interpatient heterogeneity and push precision oncology toward clinical care.\n Specifically, in the comprehensive molecular study of gynecologic and breast cancers, we identified the clinically significant patient subtypes and potential therapeutic targets, based on multi-modality data including clinical data, copy number alterations, mutations, DNA methylation, and mRNA expression. For patients with brain metastasis, we identified two distinctive prognostic subtypes through an integrative analysis of their transcriptomic, proteomic, and metabolomic molecular profiles. We also revealed the key pathways and metabolites potentially contribute to the observed survival differences between the two subtypes. During the COVID-19 pandemic, we have been working on characterizing the cancer patients within NCATS’ National COVID Cohort Collaborative (N3C), to investigate the risk factors of COVID-19 breakthrough infections and severe outcomes. Our study highlighted patients who received recent immunotherapies or targeted therapies did not have higher risk of overall mortality or breakthrough infection risks, and provided evidence on the effects of COVID-19 on cancer outcomes and the ability to continue specific cancer treatments. This work and our other collaborative studies revealed fundamental insights valuable to the precise protection of cancer population, which has been covered by national news networks such as U.S. News and Fox News.\n Our work have been published in high-impact journals including Cancer cell (IF: 35.6), Journal of Clinical Oncology (IF:45.3), etc."
      },
      {
        "title": "Collaborative consortium",
        "content": "We have established fruitful collaborations across different research disciplines, and have been actively working with scientists across the country on national informatics endeavors for battling cancer. Specifically, we have: 1) Participated in The Cancer Genome Atlas (TCGA) PanCanAtlas Group, where I worked with scientists across the country to comprehensively analyze tumor samples from breast and gynecologic cancers. 2) Contributed to genomics data assembling and sharing at the Wake Forest University site for the AACR Project GENIE (Genomics Evidence Neoplasia Information Exchange). 3) Served as a key member of the NCATS’ National COVID Cohort Collaborative (N3C) oncology domain team. Our collaborative studies (PMID: 35286152; PMID: 34255046; PMID: 34085538) have been covered by national news networks such as U.S. News and Fox News. 4) Served as the key bioinformatician at the Stand Up To Cancer (SU2C) Meg Vosburg T-Cell Lymphoma Dream Team, “Tailoring CAR-based Immunotherapy Strategies to T-cell Lymphoma”, with the goal of developing effective treatment with durable responses that can be applied to a wide variety of T-cell lymphoma malignancies. 5) Joined in the Beat Cancer Childhood (BCC) Research Consortium, aiming to identify new cures for high-risk pediatric cancers through closely collaborating with investigators from diverse backgrounds."
      }
    ]
  }
}
